compressible/CDNozzle _Share/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (-0.6  0       -0.005) //0
    (-0.2121321 0 -0.005) //1

    (0  0  -0.005) //2
    (2  0 -0.005) //3

    (-0.6  0.45       -0.005) //4
    (-0.3  0.45       -0.005) //5

    (0  0.15  -0.005)  //6
    (2  0.3 -0.005)  //7

    (-0.6  0  0.005)   //8
    (-0.2121321 0 0.005)   //9

    (0  0  0.005)     //10
    (2  0 0.005)      //11

    (-0.6  0.45  0.005)  //12
    (-0.3  0.45  0.005)  //13
    (0  0.15  0.005) //14
    (2  0.3 0.005)   //15 
    
    (-0.2121321 0.237867965 -0.005) //16
    (-0.2121321 0.237867965 0.005)  //17

    (-0.6 0.237867965 -0.005) //18
    (-0.6 0.237867965 0.005)  //19

    
    (-4 0 -0.005)
    (-4 0.237867965 -0.005)
    (-4 0.45 -0.005)
  //  (-3.00416 2.854163056 -0.005)
    (-4 3.85 -0.005)
    (-0.6 3.85 -0.005)
    (-0.3 3.85 -0.005)

    (-4 0 0.005)
    (-4 0.237867965 0.005)
    (-4 0.45 0.005)
 //   (-3.00416 2.854163056 0.005)
    (-4 3.85 0.005)
    (-0.6 3.85 0.005)
    (-0.3 3.85 0.005)
);

blocks
(
    hex (9 8 19 17 1 0 18 16) (20 20 1) simpleGrading (1 1 1)
    hex (17 19 12 13 16 18 4 5) (20 20 1) simpleGrading (1 1 1)
    hex (10 9 17 14 2 1 16 6) (20 20 1) simpleGrading (1 1 1)
    hex (11 10 14 15 3 2 6 7) (150 20 1) simpleGrading (1 1 1)
    hex (12 28 29 30 4 22 23 24) (40 40 1) simpleGrading (10 10 1)
    hex (8 26 27 19 0 20 21 18) (40 20 1) simpleGrading (10 1 1)
    hex (19 27 28 12 18 21 22 4) (40 20 1) simpleGrading (10 1 1)
    hex (13 12 30 31 5 4 24 25) (20 40 1) simpleGrading (1 10 1)
);

edges
(
    arc 5 16 (-0.295442325 0.397905546 -0.005)
    arc 16 6 (-0.052094453 0.154557674 -0.005)
    arc 13 17 (-0.295442325 0.397905546 0.005)
    arc 17 14 (-0.052094453 0.154557674 0.005)


    arc 21 23 (-3.544486373 2.15 -0.005)
    arc 27 29 (-3.544486373 2.15 0.005)

//    arc 29 31 (-2.3 3.394486373 -0.005)
//    arc 23 25 (-2.3 3.394486373 0.005)
);

boundary
(
    inlet1
    {
        type patch;
        faces
        (
            (20 26 27 21)
            (21 27 28 22)
            (22 28 29 23)
        );
    }
    top
    {
        type wall;
        faces
        (
            (23 29 30 24)
            (24 30 31 25)
        );
    }



    outlet
    {
        type patch;
        faces
        (
            (11 3 7 15)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (8 0 1 9)
	    (9 1 2 10)
	    (10 2 3 11)
            (26 20 0 8)
        );
    }
    nozzle
    {
        type wall;
        faces
        (
            (5 13 17 16)
	    (16 17 14 6)
            (6 14 15 7)
            (13 5 25 31)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
