compressible/CDNozzle _Share/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 3000000;


boundaryField
{
    inlet
    {
        type            totalPressure;
        p0              uniform 3000000;
        gamma		 1.4;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    nozzle
    {
        type            zeroGradient;
    }
    asym1
    {
        type            wedge;
    }
    asym2
    {
        type            wedge;
    }
    axis
    {
        type            empty;
    }
}

// ************************************************************************* //
